Repository: keniondang/Recipe-App-with-Internationalization-i18n-and-Localization-l10n-in-Flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, de, id, vi

# navigationHome
source: Home
ar: الرئيسية
de: Startseite
id: Beranda
vi: Trang chủ

# navigationSettings
source: Settings
ar: الإعدادات
de: Einstellungen
id: Pengaturan
vi: Cài đặt

# homeTitle
source: What are you cooking today?
ar: ماذا ستطبخ اليوم؟
de: Was kochst du heute?
id: Apa yang akan kamu masak hari ini?
vi: Hôm nay bạn sẽ nấu gì?

# searchHint
source: Search for recipes...
ar: البحث عن الوصفات...
de: Nach Rezepten suchen...
id: Cari resep...
vi: Tìm kiếm công thức...

# categoriesTitle
source: Categories
ar: الفئات
de: Kategorien
id: Kategori
vi: Danh mục

# viewAllButton
source: View All
ar: عرض الكل
de: Alle anzeigen
id: Lihat Semua
vi: Xem tất cả

source: Filter by Cuisine
ar: تصفية حسب المطبخ
de: Nach Küche filtern
id: Filter berdasarkan masakan
vi: Lọc theo ẩm thực

source: No recipes found
ar: لا توجد وصفات
de: Keine Rezepte gefunden
id: Resep tidak ditemukan
vi: Không tìm thấy công thức

# searchDifferentKeywords
source: Try searching with different keywords
ar: جرب البحث بكلمات مفتاحية مختلفة
de: Versuchen Sie es mit anderen Suchbegriffen
id: Coba cari dengan kata kunci lain
vi: Thử tìm kiếm với từ khóa khác

# minutesShort
source: {minutes}m
ar: {minutes}د
de: {minutes}min
vi: {minutes}p

source: Cook time
ar: وقت الطبخ
de: Kochzeit
id: Waktu memasak
vi: Thời gian nấu

source: Servings
ar: الحصص
de: Portionen
id: Porsi
vi: Khẩu phần

source: Rating
ar: التقييم
de: Bewertung
vi: Đánh giá

source: Ingredients
ar: المكونات
de: Zutaten
id: Bahan-bahan
vi: Nguyên liệu

source: Instructions
ar: التعليمات
de: Anweisungen
id: Instruksi
vi: Hướng dẫn

# minutesLong
source: {minutes} min
ar: {minutes} دقيقة
de: {minutes} Minuten
id: {minutes} menit
vi: {minutes} phút

# hoursLong
source: {hours} {hours, plural, =1{hour} other{hours}}
ar: {hours} {hours, plural, =1{ساعة} =2{ساعتان} few{ساعات} many{ساعة} other{ساعات}}
de: {hours} {hours, plural, =1{Stunde} other{Stunden}}
id: {hours} jam
vi: {hours} giờ

# hoursAndMinutes
source: {hours}h {minutes}m
ar: {hours}س {minutes}د
id: {hours}j {minutes}m
vi: {hours}g {minutes}p

# calories
source: cal
ar: سعرة
de: kcal
id: kal

# caloriesLong
source: calories
ar: سعرة حرارية
de: Kalorien
id: kalori
vi: calo

# daysAgo
source: {days} {days, plural, =1{day} other{days}} ago
ar: منذ {days} {days, plural, =1{يوم} =2{يومين} few{أيام} many{يوماً} other{يوم}}
de: vor {days} {days, plural, =1{Tag} other{Tagen}}
id: {days} hari yang lalu
vi: {days} ngày trước

# hoursAgo
source: {hours} {hours, plural, =1{hour} other{hours}} ago
ar: منذ {hours} {hours, plural, =1{ساعة} =2{ساعتين} few{ساعات} many{ساعة} other{ساعات}}
de: vor {hours} {hours, plural, =1{Stunde} other{Stunden}}
id: {hours} jam yang lalu
vi: {hours} giờ trước

# minutesAgo
source: {minutes} {minutes, plural, =1{minute} other{minutes}} ago
ar: منذ {minutes} {minutes, plural, =1{دقيقة} =2{دقيقتين} few{دقائق} many{دقيقة} other{دقائق}}
de: vor {minutes} {minutes, plural, =1{Minute} other{Minuten}}
id: {minutes} menit yang lalu
vi: {minutes} phút trước

source: just now
ar: منذ قليل
de: gerade eben
id: baru saja
vi: vừa xong

# createdOn
source: Created on {date}
ar: تم إنشاؤها في {date}
de: Erstellt am {date}
id: Dibuat pada {date}
vi: Tạo ngày {date}

# updatedOn
source: Updated {time}
ar: تم التحديث {time}
de: Aktualisiert {time}
id: Diperbarui {time}
vi: Cập nhật {time}

# serves
source: Serves {count}
ar: تكفي {count} {count, plural, =1{شخص} =2{شخصين} few{أشخاص} many{شخصاً} other{شخص}}
de: Für {count} Personen
id: Untuk {count} porsi
vi: Cho {count} người

# totalTime
source: Total time: {time}
ar: الوقت الإجمالي: {time}
de: Gesamtzeit: {time}
id: Total waktu: {time}
vi: Tổng thời gian: {time}

# nutritionPerServing
source: Per serving
ar: لكل حصة
de: Pro Portion
id: Per porsi
vi: Mỗi khẩu phần

# settingsTitle
source: Settings
ar: الإعدادات
de: Einstellungen
id: Pengaturan
vi: Cài đặt

# preferencesSection
source: Preferences
ar: التفضيلات
de: Einstellungen
id: Preferensi
vi: Tùy chọn

# aboutSection
source: About
ar: حول
de: Über
id: Tentang
vi: Thông tin

# languageSetting
source: Language
ar: اللغة
de: Sprache
id: Bahasa
vi: Ngôn ngữ

# languageSubtitle
source: English
ar: العربية
de: Deutsch
id: Indonesia
vi: Tiếng Việt

# notificationsSetting
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
id: Notifikasi
vi: Thông báo

# notificationsSubtitle
source: Manage your notifications
ar: إدارة الإشعارات
de: Benachrichtigungen verwalten
id: Kelola notifikasi Anda
vi: Quản lý thông báo

# themeSetting
source: Theme
ar: المظهر
de: Design
id: Tema
vi: Giao diện

# themeSubtitle
source: Light mode
ar: الوضع الفاتح
de: Heller Modus
id: Mode terang
vi: Chế độ sáng

# appInfoSetting
source: App Information
ar: معلومات التطبيق
de: App-Informationen
id: Informasi Aplikasi
vi: Thông tin ứng dụng

# appInfoSubtitle
source: Version 1.0.0
ar: الإصدار 1.0.0
id: Versi 1.0.0
vi: Phiên bản 1.0.0

# helpSetting
source: Help & Support
ar: المساعدة والدعم
de: Hilfe & Support
id: Bantuan & Dukungan
vi: Trợ giúp & Hỗ trợ

# helpSubtitle
source: Get help with the app
ar: الحصول على مساعدة بالتطبيق
de: Hilfe zur App erhalten
id: Dapatkan bantuan dengan aplikasi
vi: Nhận trợ giúp về ứng dụng

# rateSetting
source: Rate App
ar: تقييم التطبيق
de: App bewerten
id: Beri Rating Aplikasi
vi: Đánh giá ứng dụng

# rateSubtitle
source: Share your feedback
ar: شارك ملاحظاتك
de: Feedback teilen
id: Bagikan feedback Anda
vi: Chia sẻ phản hồi của bạn

# selectLanguageTitle
source: Select Language
ar: اختر اللغة
de: Sprache auswählen
id: Pilih Bahasa
vi: Chọn ngôn ngữ

# cancelButton
source: Cancel
ar: إلغاء
de: Abbrechen
id: Batal
vi: Hủy

# applyButton
source: Apply
ar: تطبيق
de: Anwenden
id: Terapkan
vi: Áp dụng

# englishLanguage
source: English
ar: الإنجليزية
de: Englisch
id: Bahasa Inggris
vi: Tiếng Anh

# vietnameseLanguage
source: Vietnamese
ar: الفيتنامية
de: Vietnamesisch
id: Bahasa Vietnam
vi: Tiếng Việt

# germanLanguage
source: German
ar: الألمانية
de: Deutsch
id: Bahasa Jerman
vi: Tiếng Đức

# indonesianLanguage
source: Indonesian
ar: الإندونيسية
de: Indonesisch
id: Bahasa Indonesia
vi: Tiếng Indonesia

# cuisineAll
source: All
ar: الكل
de: Alle
id: Semua
vi: Tất cả

# cuisineVietnamese
source: Vietnamese
ar: فيتنامي
de: Vietnamesisch
id: Vietnam
vi: Việt Nam

# cuisineWestern
source: Western
ar: غربي
de: Westlich
id: Barat
vi: Phương Tây

# cuisineIndonesian
source: Indonesian
ar: إندونيسي
de: Indonesisch
id: Indonesia
vi: Indonesia

# cuisineChinese
source: Chinese
ar: صيني
de: Chinesisch
id: Tiongkok
vi: Trung Quốc

# notificationSettingsPlaceholder
source: Notification settings will be implemented here!
ar: إعدادات الإشعارات سيتم تنفيذها هنا!
de: Benachrichtigungseinstellungen werden hier implementiert!
id: Pengaturan notifikasi akan diimplementasikan di sini!
vi: Cài đặt thông báo sẽ được triển khai ở đây!

# themeOptionsPlaceholder
source: Theme options will be implemented here!
ar: خيارات المظهر سيتم تنفيذها هنا!
de: Design-Optionen werden hier implementiert!
id: Opsi tema akan diimplementasikan di sini!
vi: Tùy chọn giao diện sẽ được triển khai ở đây!

# helpSupportPlaceholder
source: Help & Support will be implemented here!
ar: المساعدة والدعم سيتم تنفيذها هنا!
de: Hilfe & Support wird hier implementiert!
id: Bantuan & Dukungan akan diimplementasikan di sini!
vi: Trợ giúp & Hỗ trợ sẽ được triển khai ở đây!

# ratingThankYou
source: Thank you! Rating feature will be implemented here!
ar: شكراً! ميزة التقييم سيتم تنفيذها هنا!
de: Danke! Die Bewertungsfunktion wird hier implementiert!
id: Terima kasih! Fitur rating akan diimplementasikan di sini!
vi: Cảm ơn! Tính năng đánh giá sẽ được triển khai ở đây!

# appName
source: Recipe App
ar: تطبيق الوصفات
de: Rezept-App
id: Aplikasi Resep
vi: Ứng dụng Công thức

# appLegalese
source: © 2025 Recipe App. All rights reserved.
ar: © 2025 تطبيق الوصفات. جميع الحقوق محفوظة.
de: © 2025 Rezept-App. Alle Rechte vorbehalten.
id: © 2025 Aplikasi Resep. Semua hak dilindungi.
vi: © 2025 Ứng dụng Công thức. Tất cả quyền được bảo lưu.

# appDescription
source: A simple and elegant recipe app built with Flutter.
ar: تطبيق وصفات بسيط وأنيق مبني باستخدام Flutter.
de: Eine einfache und elegante Rezept-App, entwickelt mit Flutter.
id: Aplikasi resep yang sederhana dan elegan dibuat dengan Flutter.
vi: Ứng dụng công thức đơn giản và tinh tế được xây dựng bằng Flutter.

# promoBanner1
source: Cook the best recipes at home
ar: اطبخ أفضل الوصفات في المنزل
de: Koche die besten Rezepte zu Hause
id: Masak resep terbaik di rumah
vi: Nấu những công thức tuyệt nhất tại nhà

# promoBanner2
source: Discover new flavors every day
ar: اكتشف نكهات جديدة كل يوم
de: Entdecke jeden Tag neue Geschmäcker
id: Temukan rasa baru setiap hari
vi: Khám phá hương vị mới mỗi ngày

# promoBanner3
source: Simple recipes for your busy life
ar: وصفات بسيطة لحياتك المشغولة
de: Einfache Rezepte für dein geschäftiges Leben
id: Resep sederhana untuk hidup yang sibuk
vi: Công thức đơn giản cho cuộc sống bận rộn

# promoBanner4
source: Impress your guests with your skills
ar: أبهر ضيوفك بمهاراتك
de: Beeindrucke deine Gäste mit deinen Fähigkeiten
id: Buat kagum tamu dengan kemampuan Anda
vi: Gây ấn tượng với khách bằng kỹ năng của bạn

# beefSteakName
source: Beef Steak
ar: ستيك اللحم
de: Rindersteak
id: Steak Daging Sapi
vi: Bò Bít Tết

# beefSteakDescription
source: Perfectly grilled beef steak with herbs.
ar: ستيك لحم مشوي بالأعشاب بطريقة مثالية.
de: Perfekt gegrilltes Rindersteak mit Kräutern.
id: Steak daging sapi panggang sempurna dengan bumbu herbal.
vi: Bò bít tết nướng hoàn hảo với thảo mộc.

# beefSteakIngredient1Quantity
source: 2 pieces
ar: قطعتان
de: 2 Stück
id: 2 potong
vi: 2 miếng

# beefSteakIngredient1Name
source: beef steaks (8oz each)
ar: ستيك لحم بقري (8 أونصة لكل قطعة)
de: Rindersteaks (je 8oz)
id: steak daging sapi (8oz setiap potong)
vi: bò bít tết (8oz mỗi miếng)

# beefSteakIngredient2Quantity
source: 2 tbsp
ar: ملعقتان كبيرتان
de: 2 EL
id: 2 sdm
vi: 2 thìa canh

# beefSteakIngredient2Name
source: olive oil
ar: زيت الزيتون
de: Olivenöl
id: minyak zaitun
vi: dầu ô liu

# beefSteakIngredient3Quantity
source: 1 tsp
ar: ملعقة صغيرة
de: 1 TL
id: 1 sdt
vi: 1 thìa cà phê

# beefSteakIngredient3Name
source: salt
ar: ملح
de: Salz
id: garam
vi: muối

# beefSteakIngredient4Quantity
source: 1/2 tsp
ar: نصف ملعقة صغيرة
de: 1/2 TL
id: 1/2 sdt
vi: 1/2 thìa cà phê

# beefSteakIngredient4Name
source: black pepper
ar: فلفل أسود
de: schwarzer Pfeffer
id: lada hitam
vi: tiêu đen

# beefSteakStep1
source: Season steaks with salt and pepper on both sides.
ar: تبّل قطع الستيك بالملح والفلفل من الجهتين.
de: Steaks beidseitig mit Salz und Pfeffer würzen.
id: Bumbui steak dengan garam dan lada di kedua sisi.
vi: Ướp bò với muối và tiêu ở cả hai mặt.

# beefSteakStep2
source: Heat olive oil in a cast iron pan over high heat.
ar: سخّن زيت الزيتون في مقلاة حديد على نار عالية.
de: Olivenöl in einer Gusseisenpfanne bei hoher Hitze erhitzen.
id: Panaskan minyak zaitun di wajan besi dengan api besar.
vi: Đun nóng dầu ô liu trong chảo gang ở lửa lớn.

# beefSteakStep3
source: Sear steaks for 3-4 minutes each side for medium-rare.
ar: اشوِ الستيك لمدة 3-4 دقائق من كل جهة للحصول على نضج متوسط.
de: Steaks 3-4 Minuten pro Seite für medium-rare braten.
id: Panggang steak 3-4 menit setiap sisi untuk medium-rare.
vi: Áp chảo bò 3-4 phút mỗi mặt để được vừa chín.

# beefSteakStep4
source: Add butter, garlic, and rosemary to the pan.
ar: أضف الزبدة والثوم وإكليل الجبل للمقلاة.
de: Butter, Knoblauch und Rosmarin in die Pfanne geben.
id: Tambahkan mentega, bawang putih, dan rosemary ke wajan.
vi: Thêm bơ, tỏi và hương thảo vào chảo.

# beefSteakStep5
source: Baste steaks with herb butter for extra flavor.
ar: ادهن الستيك بزبدة الأعشاب لنكهة إضافية.
de: Steaks mit Kräuterbutter begießen für extra Geschmack.
id: Siram steak dengan mentega herbal untuk rasa ekstra.
vi: Tưới bò với bơ thảo mộc để thêm hương vị.

# beefSteakStep6
source: Rest for 5 minutes before serving.
ar: اتركه يرتاح لمدة 5 دقائق قبل التقديم.
de: 5 Minuten ruhen lassen vor dem Servieren.
id: Diamkan selama 5 menit sebelum disajikan.
vi: Để nghỉ 5 phút trước khi dọn ra.

# phoBoName
source: Pho Bo
ar: فو بو
vi: Phở Bò

# phoBoDescription
source: Traditional Vietnamese beef noodle soup.
ar: حساء شعيرية اللحم الفيتنامي التقليدي.
de: Traditionelle vietnamesische Rindfleisch-Nudelsuppe.
id: Sup mie daging sapi tradisional Vietnam.
vi: Phở bò truyền thống Việt Nam.

# phoBoIngredient1Quantity
source: 1 kg
ar: 1 كيلو

# phoBoIngredient1Name
source: beef bones
ar: عظام لحم البقر
de: Rinderknochen
id: tulang sapi
vi: xương bò

# phoBoIngredient2Quantity
source: 400g
ar: 400 جرام

# phoBoIngredient2Name
source: rice noodles (bánh phở)
ar: شعيرية الأرز (bánh phở)
de: Reisnudeln (bánh phở)
id: mie beras (bánh phở)
vi: bánh phở

# phoBoIngredient3Quantity
source: 3 pieces
ar: 3 قطع
de: 3 Stück
id: 3 buah
vi: 3 cái

# phoBoIngredient3Name
source: star anise
ar: يانسون نجمي
de: Sternanis
id: bunga lawang
vi: hoa hồi

# phoBoIngredient4Quantity
source: 1 stick
ar: عود واحد
de: 1 Stange
id: 1 batang
vi: 1 thanh

# phoBoIngredient4Name
source: cinnamon
ar: قرفة
de: Zimt
id: kayu manis
vi: quế

# phoBoStep1
source: Char onion and ginger over open flame until fragrant.
ar: حمّص البصل والزنجبيل على نار مكشوفة حتى تفوح رائحتهما.
de: Zwiebel und Ingwer über offener Flamme rösten bis aromatisch.
id: Panggang bawang bombay dan jahe di atas api terbuka hingga harum.
vi: Nướng hành tây và gừng trên lửa cho thơm.

# phoBoStep2
source: Boil beef bones with spices for 3 hours to make broth.
ar: اسلقي عظام اللحم مع التوابل لمدة 3 ساعات لعمل المرق.
de: Rinderknochen 3 Stunden mit Gewürzen kochen für Brühe.
id: Rebus tulang sapi dengan rempah selama 3 jam untuk membuat kaldu.
vi: Ninh xương bò với gia vị trong 3 tiếng để có nước dùng.

# phoBoStep3
source: Cook rice noodles according to package instructions.
ar: اطبخي شعيرية الأرز حسب تعليمات العبوة.
de: Reisnudeln nach Packungsanweisung kochen.
id: Masak mie beras sesuai petunjuk kemasan.
vi: Luộc bánh phở theo hướng dẫn trên bao bì.

# phoBoStep4
source: Slice beef thinly for quick cooking.
ar: قطّعي لحم البقر شرائح رفيعة للطبخ السريع.
de: Rindfleisch dünn schneiden für schnelles Garen.
id: Iris daging sapi tipis untuk masak cepat.
vi: Thái thịt bò mỏng để nấu nhanh.

# phoBoStep5
source: Assemble bowls with noodles and raw beef.
ar: رتّبي الأطباق بالشعيرية واللحم النيء.
de: Schalen mit Nudeln und rohem Rindfleisch zusammenstellen.
id: Susun mangkuk dengan mie dan daging sapi mentah.
vi: Xếp bánh phở và thịt bò sống vào tô.

# phoBoStep6
source: Pour hot broth over to cook beef and garnish with herbs.
ar: اسكبي المرق الساخن لطبخ اللحم وزيّني بالأعشاب.
de: Heiße Brühe darüber gießen um Fleisch zu garen und mit Kräutern garnieren.
id: Tuang kaldu panas untuk memasak daging dan hiasi dengan herbal.
vi: Đổ nước dùng nóng lên để chín thịt và trang trí với rau thơm.

# banhMiName
source: Vietnamese Banh Mi
ar: بانه مي فيتنامي
de: Vietnamesisches Banh Mi
id: Banh Mi Vietnam
vi: Bánh Mì Việt Nam

# banhMiDescription
source: Crispy baguette with Vietnamese pickled vegetables.
ar: خبز مقرمش مع خضار فيتنامية مخللة.
de: Knuspriges Baguette mit vietnamesischem eingelegtem Gemüse.
id: Roti baguette renyah dengan acar sayuran Vietnam.
vi: Bánh mì giòn với rau củ chua Việt Nam.

# banhMiIngredient1Name
source: French baguettes
ar: رغيف خبز فرنسي
de: französische Baguettes
id: baguette Prancis
vi: bánh mì Pháp

# banhMiIngredient2Quantity
source: 200g
ar: 200 جرام

# banhMiIngredient2Name
source: Vietnamese ham
ar: لحم خنزير فيتنامي
de: vietnamesischer Schinken
id: ham Vietnam
vi: chả lụa

# banhMiIngredient3Quantity
source: 100g
ar: 100 جرام

# banhMiIngredient3Name
source: pickled carrots
ar: جزر مخلل
de: eingelegte Karotten
id: acar wortel
vi: cà rốt ngâm chua

# banhMiIngredient4Quantity
source: 1/4 cup
ar: ربع كوب
de: 1/4 Tasse
id: 1/4 cangkir
vi: 1/4 chén

# banhMiIngredient4Name
source: cilantro leaves
ar: أوراق الكزبرة
de: Korianderblätter
id: daun ketumbar
vi: lá ngò

# banhMiStep1
source: Slice baguettes lengthwise, hollow slightly.
ar: اقطعي الخبز طولياً واجوّفيه قليلاً.
de: Baguettes längs aufschneiden, leicht aushöhlen.
id: Iris baguette memanjang, korek sedikit isinya.
vi: Rạch bánh mì dọc, khoét bớt ruột.

# banhMiStep2
source: Spread mayonnaise and pâté inside.
ar: ادهني المايونيز والباتيه من الداخل.
de: Mayonnaise und Pastete innen verstreichen.
id: Oles mayonnaise dan pâté di dalam.
vi: Phết mayonnaise và pâté vào trong.

# banhMiStep3
source: Layer with Vietnamese ham and cucumber.
ar: ضعي طبقات من اللحم الفيتنامي والخيار.
de: Mit vietnamesischem Schinken und Gurke belegen.
id: Tata dengan ham Vietnam dan timun.
vi: Xếp chả lụa và dưa chuột.

# banhMiStep4
source: Add pickled vegetables and cilantro.
ar: أضيفي الخضار المخللة والكزبرة.
de: Eingelegtes Gemüse und Koriander hinzufügen.
id: Tambahkan acar sayuran dan ketumbar.
vi: Thêm rau củ ngâm chua và ngò.

# banhMiStep5
source: Season with soy sauce and chili.
ar: تبّلي بصوص الصويا والفلفل الحار.
de: Mit Sojasauce und Chili würzen.
id: Bumbui dengan kecap asin dan cabai.
vi: Nêm nếm với nước tương và ớt.

# banhMiStep6
source: Press sandwich lightly and serve fresh.
ar: اضغطي على الساندويش قليلاً وقدّميه طازجاً.
de: Sandwich leicht pressen und frisch servieren.
id: Tekan sandwich ringan dan sajikan segar.
vi: Ép nhẹ bánh mì và dọn tươi.

# bunBoHueName
source: Bun Bo Hue
ar: بون بو هوي
vi: Bún Bò Huế

# bunBoHueDescription
source: Spicy beef noodle soup from Hue.
ar: حساء شعيرية لحم حار من هوي.
de: Scharfe Rindfleisch-Nudelsuppe aus Hue.
id: Sup mie daging sapi pedas dari Hue.
vi: Bún bò cay đặc sản Huế.

# bunBoHueIngredient1Quantity
source: 400g
ar: 400 جرام

# bunBoHueIngredient1Name
source: thick round rice noodles
ar: شعيرية أرز دائرية سميكة
de: dicke runde Reisnudeln
id: mie beras tebal bulat
vi: bún tròn

# bunBoHueIngredient2Quantity
source: 500g
ar: 500 جرام

# bunBoHueIngredient2Name
source: beef shank
ar: ساق لحم بقري
de: Rinderhaxe
id: daging sapi bagian betis
vi: thịt bò

# bunBoHueIngredient3Quantity
source: 200g
ar: 200 جرام

# bunBoHueIngredient3Name
source: pork hock
ar: ساق خنزير
de: Schweinshaxe
id: kaki babi
vi: giò heo

# bunBoHueIngredient4Quantity
source: 3 tbsp
ar: 3 ملاعق كبيرة
de: 3 EL
id: 3 sdm
vi: 3 thìa canh

# bunBoHueIngredient4Name
source: shrimp paste
ar: معجون الروبيان
de: Garnelenpaste
id: terasi udang
vi: mắm ruốc

# bunBoHueIngredient5Quantity
source: 2 tbsp
ar: ملعقتان كبيرتان
de: 2 EL
id: 2 sdm
vi: 2 thìa canh

# bunBoHueIngredient5Name
source: chili oil
ar: زيت الفلفل الحار
de: Chiliöl
id: minyak cabai
vi: dầu ớt

# bunBoHueStep1
source: Boil beef and pork bones for rich broth.
ar: اسلقي عظام اللحم والخنزير للحصول على مرق غني.
de: Rinder- und Schweineknochen für kräftige Brühe kochen.
id: Rebus tulang sapi dan babi untuk kaldu yang kaya.
vi: Ninh xương bò và heo để có nước dùng đậm đà.

# bunBoHueStep2
source: Add lemongrass, onions, and spices to broth.
ar: أضيفي عشب الليمون والبصل والتوابل للمرق.
de: Zitronengras, Zwiebeln und Gewürze zur Brühe geben.
id: Tambahkan serai, bawang bombay, dan rempah ke kaldu.
vi: Thêm sả, hành tây và gia vị vào nước dùng.

# bunBoHueStep3
source: Cook thick rice noodles until tender.
ar: اطبخي الشعيرية السميكة حتى تنضج.
de: Dicke Reisnudeln weich kochen.
id: Masak mie beras tebal hingga empuk.
vi: Luộc bún cho mềm.

# bunBoHueStep4
source: Slice cooked beef and pork thinly.
ar: قطّعي اللحم المطبوخ والخنزير شرائح رفيعة.
de: Gekochtes Rind und Schwein dünn schneiden.
id: Iris daging sapi dan babi yang sudah matang tipis-tipis.
vi: Thái thịt bò và heo mỏng.

# bunBoHueStep5
source: Season broth with shrimp paste and chili oil.
ar: تبّلي المرق بمعجون الروبيان وزيت الفلفل الحار.
de: Brühe mit Garnelenpaste und Chiliöl würzen.
id: Bumbui kaldu dengan terasi udang dan minyak cabai.
vi: Nêm nước dùng với mắm ruốc và dầu ớt.

# bunBoHueStep6
source: Serve with fresh herbs and lime wedges.
ar: قدّمي مع الأعشاب الطازجة وقطع الليمون.
de: Mit frischen Kräutern und Limettenschnitzen servieren.
id: Sajikan dengan herbal segar dan irisan jeruk nipis.
vi: Dọn với rau thơm và chanh.

# rendangName
source: Beef Rendang
ar: رندانغ اللحم
de: Rindfleisch Rendang
id: Rendang Daging Sapi
vi: Rendang Bò

# rendangDescription
source: Indonesian slow-cooked spicy beef curry.
ar: كاري لحم حار إندونيسي مطبوخ ببطء.
de: Indonesisches langsam gekochtes scharfes Rindfleisch-Curry.
id: Kari daging sapi pedas masak lambat khas Indonesia.
vi: Cà ri bò cay nấu chậm kiểu Indonesia.

# rendangIngredient1Quantity
source: 800g
ar: 800 جرام

# rendangIngredient1Name
source: beef chuck, cubed
ar: لحم بقري مقطع مكعبات
de: Rindfleisch, gewürfelt
id: daging sapi chuck, potong dadu
vi: thịt bò thăn, cắt miếng

# rendangIngredient2Quantity
source: 400ml
ar: 400 مل

# rendangIngredient2Name
source: coconut milk
ar: حليب جوز الهند
de: Kokosmilch
id: santan
vi: nước cốt dừa

# rendangIngredient3Quantity
source: 4 tbsp
ar: 4 ملاعق كبيرة
de: 4 EL
id: 4 sdm
vi: 4 thìa canh

# rendangIngredient3Name
source: rendang spice paste
ar: معجون توابل الرندانغ
de: Rendang-Gewürzpaste
id: bumbu rendang
vi: kroeung rendang

# rendangIngredient4Name
source: lemongrass stalks
ar: عشب الليمون
de: Zitronengras-Stängel
id: serai
vi: sả

# rendangStep1
source: Brown beef cubes in a heavy pot.
ar: حمّري مكعبات اللحم في إناء ثقيل القاع.
de: Rindfleischwürfel in einem schweren Topf anbraten.
id: Tumis daging sapi dalam panci tebal hingga kecoklatan.
vi: Áp chảo thịt bò trong nồi nặng đáy.

# rendangStep2
source: Add spice paste and cook until fragrant.
ar: أضيفي معجون التوابل واطبخي حتى تفوح الرائحة.
de: Gewürzpaste hinzufügen und kochen bis aromatisch.
id: Tambahkan bumbu dan masak hingga harum.
vi: Thêm kroeung và xào cho thơm.

# rendangStep3
source: Pour in coconut milk and add aromatics.
ar: اسكبي حليب جوز الهند وأضيفي العطريات.
de: Kokosmilch eingießen und Aromaten hinzufügen.
id: Tuang santan dan tambahkan serai.
vi: Đổ nước cốt dừa và thêm sả.

# rendangStep4
source: Simmer on low heat for 2 hours.
ar: اتركي الخليط ينضج على نار هادئة لمدة ساعتين.
de: 2 Stunden bei niedriger Hitze köcheln lassen.
id: Masak dengan api kecil selama 2 jam.
vi: Ninh lửa nhỏ trong 2 tiếng.

# rendangStep5
source: Continue cooking until sauce thickens.
ar: واصلي الطبخ حتى يثخن القوام.
de: Weiterkochen bis die Sauce eindickt.
id: Lanjutkan memasak hingga kuah mengental.
vi: Tiếp tục nấu cho đến khi nước sốt đặc.

# rendangStep6
source: Stir frequently in final 30 minutes until dark.
ar: حرّكي باستمرار في آخر 30 دقيقة حتى يصبح لونه داكناً.
de: In den letzten 30 Minuten häufig rühren bis dunkel.
id: Aduk sering di 30 menit terakhir hingga berwarna gelap.
vi: Khuấy thường xuyên trong 30 phút cuối cho đến khi thẫm màu.

# satayName
source: Chicken Satay
ar: ساتيه الدجاج
de: Hähnchen-Satay
id: Sate Ayam
vi: Sate Gà

# satayDescription
source: Grilled chicken skewers with peanut sauce.
ar: أسياخ دجاج مشوية مع صوص الفول السوداني.
de: Gegrillte Hähnchen-Spieße mit Erdnusssauce.
id: Tusuk sate ayam panggang dengan saus kacang.
vi: Xiên gà nướng với nước chấm đậu phộng.

# satayIngredient1Quantity
source: 600g
ar: 600 جرام

# satayIngredient1Name
source: chicken thigh, cubed
ar: فخذ دجاج مقطع مكعبات
de: Hähnchenschenkel, gewürfelt
id: paha ayam, potong dadu
vi: đùi gà, cắt miếng

# satayIngredient2Quantity
source: 2 tbsp
ar: ملعقتان كبيرتان
de: 2 EL
id: 2 sdm
vi: 2 thìa canh

# satayIngredient2Name
source: coconut milk
ar: حليب جوز الهند
de: Kokosmilch
id: santan
vi: nước cốt dừa

# satayIngredient3Quantity
source: 1 tbsp
ar: ملعقة كبيرة
de: 1 EL
id: 1 sdm
vi: 1 thìa canh

# satayIngredient3Name
source: palm sugar
ar: سكر النخيل
de: Palmzucker
id: gula kelapa
vi: đường thốt nốt

# satayIngredient4Name
source: bamboo skewers
ar: سيخ خيزران
de: Bambusspieße
id: tusuk sate bambu
vi: xiên tre
