Repository: keniondang/Recipe-App-with-Internationalization-i18n-and-Localization-l10n-in-Flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, de, id, vi

# satayIngredient5Quantity
source: 1/2 cup
ar: نصف كوب
de: 1/2 Tasse
id: 1/2 cangkir
vi: 1/2 chén

# satayIngredient5Name
source: peanut sauce
ar: صوص الفول السوداني
de: Erdnusssauce
id: saus kacang
vi: nước chấm đậu phộng

# satayStep1
source: Marinate chicken in coconut milk and spices.
ar: تبّلي الدجاج في حليب جوز الهند والتوابل.
de: Hähnchen in Kokosmilch und Gewürzen marinieren.
id: Marinasi ayam dalam santan dan bumbu.
vi: Ướp gà trong nước cốt dừa và gia vị.

# satayStep2
source: Thread chicken onto soaked bamboo skewers.
ar: اربطي الدجاج في أسياخ الخيزران المنقوعة.
de: Hähnchen auf eingeweichte Bambusspieße stecken.
id: Tusuk ayam ke tusuk sate bambu yang sudah direndam.
vi: Xuyên gà vào xiên tre đã ngâm nước.

# satayStep3
source: Grill over charcoal until golden brown.
ar: اشويها على الفحم حتى تصبح ذهبية اللون.
de: Über Holzkohle grillen bis goldbraun.
id: Panggang di atas arang hingga keemasan.
vi: Nướng trên than cho đến khi vàng.

# satayStep4
source: Baste with remaining marinade while cooking.
ar: ادهنيها بالتتبيلة المتبقية أثناء الشوي.
de: Mit restlicher Marinade beim Grillen bestreichen.
id: Oles dengan sisa bumbu marinasi saat memanggang.
vi: Quét nước ướp còn lại trong khi nướng.

# satayStep5
source: Prepare peanut sauce with ground peanuts.
ar: حضّري صوص الفول السوداني بالفول السوداني المطحون.
de: Erdnusssauce mit gemahlenen Erdnüssen zubereiten.
id: Buat saus kacang dengan kacang tanah halus.
vi: Pha nước chấm đậu phộng.

# satayStep6
source: Serve hot with peanut sauce and cucumber.
ar: قدّميها ساخنة مع صوص الفول السوداني والخيار.
de: Heiß mit Erdnusssauce und Gurke servieren.
id: Sajikan panas dengan saus kacang dan timun.
vi: Dọn nóng với nước chấm đậu phộng và dưa chuột.

# kungPaoChickenName
source: Kung Pao Chicken
ar: دجاج كونغ باو
de: Kung Pao Hähnchen
id: Ayam Kung Pao
vi: Gà Kung Pao

# kungPaoChickenDescription
source: Spicy Sichuan chicken with peanuts.
ar: دجاج سيتشوان حار مع الفول السوداني.
de: Scharfes Sichuan-Hähnchen mit Erdnüssen.
id: Ayam pedas Sichuan dengan kacang tanah.
vi: Gà cay Tứ Xuyên với đậu phộng.

# kungPaoChickenIngredient1Quantity
source: 500g
ar: 500 جرام

# kungPaoChickenIngredient1Name
source: chicken breast, diced
ar: صدر دجاج مقطع مكعبات
de: Hähnchenbrust, gewürfelt
id: dada ayam, potong dadu
vi: ức gà, cắt hạt lựu

# kungPaoChickenIngredient2Quantity
source: 1/2 cup
ar: نصف كوب
de: 1/2 Tasse
id: 1/2 cangkir
vi: 1/2 chén

# kungPaoChickenIngredient2Name
source: roasted peanuts
ar: فول سوداني محمص
de: geröstete Erdnüsse
id: kacang tanah sangrai
vi: đậu phộng rang

# kungPaoChickenIngredient3Name
source: dried chilies
ar: فلفل حار مجفف
de: getrocknete Chilischoten
id: cabai kering
vi: ớt khô

# kungPaoChickenIngredient4Quantity
source: 1 tsp
ar: ملعقة صغيرة
de: 1 TL
id: 1 sdt
vi: 1 thìa cà phê

# kungPaoChickenIngredient4Name
source: Sichuan peppercorns
ar: حبوب فلفل سيتشوان
de: Sichuan-Pfefferkörner
id: merica Sichuan
vi: hạt tiêu Tứ Xuyên

# kungPaoChickenStep1
source: Marinate chicken pieces in soy sauce and rice wine.
ar: تبّلي قطع الدجاج في صوص الصويا ونبيذ الأرز.
de: Hähnchenstücke in Sojasauce und Reiswein marinieren.
id: Marinasi potongan ayam dalam kecap asin dan arak beras.
vi: Ướp gà trong nước tương và rượu gạo.

# kungPaoChickenStep2
source: Toast peanuts and dried chilies until fragrant.
ar: حمّصي الفول السوداني والفلفل المجفف حتى تفوح رائحتهما.
de: Erdnüsse und getrocknete Chilischoten rösten bis aromatisch.
id: Panggang kacang tanah dan cabai kering hingga harum.
vi: Rang đậu phộng và ớt khô cho thơm.

# kungPaoChickenStep3
source: Stir-fry chicken until golden brown.
ar: اقلي الدجاج حتى يصبح ذهبي اللون.
de: Hähnchen anbraten bis goldbraun.
id: Tumis ayam hingga keemasan.
vi: Xào gà cho đến khi vàng.

# kungPaoChickenStep4
source: Add aromatics and sauce, toss well.
ar: أضيفي العطريات والصوص واخلطي جيداً.
de: Aromaten und Sauce hinzufügen, gut vermischen.
id: Tambahkan bumbu aromatik dan saus, aduk rata.
vi: Thêm gia vị thơm và nước sốt, trộn đều.

# kungPaoChickenStep5
source: Add peanuts and mix everything together.
ar: أضيفي الفول السوداني واخلطي كل شيء معاً.
de: Erdnüsse hinzufügen und alles zusammenmischen.
id: Tambahkan kacang tanah dan campur semua bahan.
vi: Thêm đậu phộng và trộn mọi thứ lại.

# kungPaoChickenStep6
source: Serve hot with steamed rice.
ar: قدّميه ساخناً مع الأرز المطهو بالبخار.
de: Heiß mit gedämpftem Reis servieren.
id: Sajikan panas dengan nasi putih.
vi: Dọn nóng với cơm trắng.

source: Estimated cost
ar: التكلفة المقدرة
de: Geschätzte Kosten
id: Perkiraan biaya
vi: Chi phí ước tính

source: Cost per serving
ar: التكلفة لكل حصة
de: Kosten pro Portion
id: Biaya per porsi
vi: Chi phí mỗi khẩu phần

source: Budget friendly
ar: اقتصادي
de: Budgetfreundlich
id: Ramah anggaran
vi: Thân thiện ngân sách

source: Moderate price
ar: سعر متوسط
de: Moderater Preis
id: Harga sedang
vi: Giá vừa phải

source: Premium recipe
ar: وصفة فاخرة
de: Premium-Rezept
id: Resep premium
vi: Công thức cao cấp

source: Price not available
ar: السعر غير متوفر
de: Preis nicht verfügbar
id: Harga tidak tersedia
vi: Giá không có sẵn

source: Total ingredients price
ar: إجمالي سعر المكونات
de: Gesamtpreis der Zutaten
id: Total harga bahan
vi: Tổng giá nguyên liệu
